wrangler-cep-components/org.wso2.cep.wrangler.mgt.ui/src/main/resources/web/wrangler-mgt/client.html

<script language="javascript">
function CreateXMLHttpRequest() {

    if (typeof XMLHttpRequest != "undefined") {

        //All modern browsers (IE7+, Firefox, Chrome, Safari, and Opera) uses XMLHttpRequest object
        document.getElementById("id").innerHTML="Nisssssala";
        return new XMLHttpRequest();

    }

    else if (typeof ActiveXObject != "undefined") {

        //Internet Explorer (IE5 and IE6) uses an ActiveX Object

        return new ActiveXObject("Microsoft.XMLHTTP");

    }

    else {
        document.getElementById("id").innerHTML="Nisala";
        throw new Error("XMLHttpRequestnot supported");

    }

}

function myFun(){

var objXMLHttpRequest = CreateXMLHttpRequest();

objXMLHttpRequest.open("POST", "https://localhost:9443/services/SaveRegManager", false);

objXMLHttpRequest.onreadystatechange = function () {

    if (objXMLHttpRequest.readyState == 4 && objXMLHttpRequest.status == 200) {

        result = objXMLHttpRequest.responseXML;
	

    }

}

objXMLHttpRequest.setRequestHeader("Content-Type", "text/xml");

var packet = '<?xml version="1.0" encoding="utf-8" ?>'+

                '<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">'+

                    '<soap:Body>'+

                        '<saveRegistry xmlns="http://schemas.xmlsoap.org/wsdl/">'+

                           '<sscript>value </sscript>'+


                        '</saveRegistry>'+

                     '</soap:Body>'+

               '</soap:Envelope>';


objXMLHttpRequest.send(packet);


}
    function my(){

}

</script>

<html>
<button onclick="myFun()" id="id">Click</button>
</html>

